// fur_search_login/call/call.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    color:["#39b54a","#1cbbb4"],
    list:[{"dept": "校团委", "phone": "0371-67783156"}, {"dept": "教务处", "phone": "0371-67781096"}, {"dept": "学生处(心理健康教育中心)", "phone": "0371-67781116"}, {"dept": "校长办公室", "phone": "0371-67783111"}, {"dept": "保卫处", "phone": "0371-67783260"}, {"dept": "新校区报警电话", "phone": "0371-67783110"}, {"dept": "北校区报警电话", "phone": "0371-63887110"}, {"dept": "南校区报警电话", "phone": "0371-67766110"}, {"dept": "东校区报警电话", "phone": "0371-66658110"}, {"dept": "招生办公室", "phone": "0371-67781182"}, {"dept": "大学生就业创业指导服务中心", "phone": "0371-67781190"}, {"dept": "党委宣传部", "phone": "0371-67781030"}, {"dept": "党委统战部", "phone": "0371-67781035"}, {"dept": "党委学生工作部", "phone": "0371-67781116"}, {"dept": "党委办公室(保密委员会办公室)", "phone": "0371-67781096"}, {"dept": "发展规划处(信息化建设办公室)", "phone": "0371-67781195"}, {"dept": "学术(学位)委员会办公室", "phone": "0371-67739539"}, {"dept": "学科与重点建设处", "phone": "0371-67739605"}, {"dept": "人事处(教师发展中心、人才交流中心)", "phone": "0371-67781080"}, {"dept": "高层次人才工作办公室", "phone": "0371-67781087"}, {"dept": "研究生院、党委研究生工作部", "phone": "0371-67780050"}, {"dept": "科学与技术研究院", "phone": "0371-67781696"}, {"dept": "社会科学处", "phone": "0371-67781213"}, {"dept": "财务处(校园卡管理中心)", "phone": "0371-67781122"}, {"dept": "国际交流与合作处(港澳台事务办公室)", "phone": "0371-67780026"}, {"dept": "审计处", "phone": "0371-67781153"}, {"dept": "基建处(人才公寓开发与管理中心)", "phone": "0371-67783206"}, {"dept": "后勤管理处", "phone": "0371-67780031"}, {"dept": "南校区综合管理中心", "phone": "0371-67762001"}, {"dept": "北校区综合管理中心", "phone": "0371-63887041、63887153（值班室）"}, {"dept": "东校区综合管理中心(医管办)", "phone": "0371-66658007"}]

  },
  CallPhone:function(e){
    wx.makePhoneCall({
      phoneNumber: e.currentTarget.dataset.phone,
      success:function(){
        console.log("拨打电话成功");
      },
      fail: function () {
        console.log("拨打电话失败");
      }
    })
    
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})